products/admin/fedexwsdl/RateRequest_Intra_MX_Exp_Saver_v13.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v13="http://fedex.com/ws/rate/v13">
   <soapenv:Header/>
   <soapenv:Body>
      <v13:RateRequest>
         <v13:WebAuthenticationDetail>
            <v13:UserCredential>
               <v13:Key></v13:Key>
               <v13:Password/>
            </v13:UserCredential>
         </v13:WebAuthenticationDetail>
         <v13:ClientDetail>
            <v13:AccountNumber></v13:AccountNumber>
            <v13:MeterNumber></v13:MeterNumber>
         </v13:ClientDetail>
         <v13:TransactionDetail>
            <v13:CustomerTransactionId>RateRequest_Intra_MX_Exp_Saver</v13:CustomerTransactionId>
         </v13:TransactionDetail>
         <v13:Version>
            <v13:ServiceId>crs</v13:ServiceId>
            <v13:Major>13</v13:Major>
            <v13:Intermediate>0</v13:Intermediate>
            <v13:Minor>0</v13:Minor>
         </v13:Version>
         <v13:RequestedShipment>
            <v13:ShipTimestamp>2011-06-15T09:30:47-05:00</v13:ShipTimestamp>
            <v13:DropoffType>REGULAR_PICKUP</v13:DropoffType>
            <v13:ServiceType>FEDEX_EXPRESS_SAVER</v13:ServiceType>
            <v13:PackagingType>YOUR_PACKAGING</v13:PackagingType>
            <v13:TotalWeight>
               <v13:Units>LB</v13:Units>
               <v13:Value>50.0</v13:Value>
            </v13:TotalWeight>
            <v13:Shipper>
               <v13:Tins>
                  <v13:TinType>PERSONAL_STATE</v13:TinType>
                  <v13:Number>412998934014</v13:Number>
               </v13:Tins>
               <v13:Contact>
                  <v13:PersonName>WAPI</v13:PersonName>
                  <v13:CompanyName>CSCA-WAPI</v13:CompanyName>
                  <v13:PhoneNumber>1234567890</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>Test Address Line1 - Sender</v13:StreetLines>
                  <v13:StreetLines>Test Address Line2 - Sender</v13:StreetLines>
                  <v13:City>NAUCALPAN</v13:City>
                  <v13:StateOrProvinceCode>NL</v13:StateOrProvinceCode>
                  <v13:PostalCode>64006</v13:PostalCode>
                  <v13:CountryCode>MX</v13:CountryCode>
               </v13:Address>
            </v13:Shipper>
            <v13:Recipient>
               <v13:Tins>
                  <v13:TinType>BUSINESS_STATE</v13:TinType>
                  <v13:Number>101401414</v13:Number>
               </v13:Tins>
               <v13:Contact>
                  <v13:PersonName>WAPI</v13:PersonName>
                  <v13:CompanyName>SENDER</v13:CompanyName>
                  <v13:PhoneNumber>1234567890</v13:PhoneNumber>
               </v13:Contact>
               <v13:Address>
                  <v13:StreetLines>WAPI SENDER Avenue</v13:StreetLines>
                  <v13:StreetLines>WAPI SENDER Avenue2</v13:StreetLines>
                  <v13:City>MONTERREY</v13:City>
                  <v13:StateOrProvinceCode>NL</v13:StateOrProvinceCode>
                  <v13:PostalCode>64006</v13:PostalCode>
                  <v13:CountryCode>MX</v13:CountryCode>
               </v13:Address>
            </v13:Recipient>
            <v13:ShippingChargesPayment>
               <v13:PaymentType>SENDER</v13:PaymentType>
               <v13:Payor>
                  <v13:ResponsibleParty>
                     <v13:AccountNumber/>
                     <v13:Tins>
                        <v13:TinType>BUSINESS_STATE</v13:TinType>
                        <v13:Number>123456</v13:Number>
                     </v13:Tins>
                  </v13:ResponsibleParty>
               </v13:Payor>
            </v13:ShippingChargesPayment>
            <v13:CustomsClearanceDetail>
               <v13:RecipientCustomsId>
                  <v13:Type>INDIVIDUAL</v13:Type>
                  <v13:Value>123456789</v13:Value>
               </v13:RecipientCustomsId>
               <v13:DutiesPayment>
                  <v13:PaymentType>SENDER</v13:PaymentType>
                  <v13:Payor>
                     <v13:ResponsibleParty>
                        <v13:AccountNumber/>
                        <v13:Tins>
                           <v13:TinType>BUSINESS_STATE</v13:TinType>
                           <v13:Number>123456</v13:Number>
                        </v13:Tins>
                     </v13:ResponsibleParty>
                  </v13:Payor>
               </v13:DutiesPayment>
               <v13:DocumentContent>DOCUMENTS_ONLY</v13:DocumentContent>
               <v13:CustomsValue>
                  <v13:Currency>NMP</v13:Currency>
                  <v13:Amount>2500.000000</v13:Amount>
               </v13:CustomsValue>
               <v13:InsuranceCharges>
                  <v13:Currency>NMP</v13:Currency>
                  <v13:Amount>15.00</v13:Amount>
               </v13:InsuranceCharges>
               <v13:Commodities>
                  <v13:NumberOfPieces>1</v13:NumberOfPieces>
                  <v13:Description>ABCD</v13:Description>
                  <v13:CountryOfManufacture>MX</v13:CountryOfManufacture>
                  <v13:HarmonizedCode>84212100</v13:HarmonizedCode>
                  <v13:Weight>
                     <v13:Units>LB</v13:Units>
                     <v13:Value>100.0</v13:Value>
                  </v13:Weight>
                  <v13:Quantity>250</v13:Quantity>
                  <v13:QuantityUnits>LITERS</v13:QuantityUnits>
                  <v13:UnitPrice>
                     <v13:Currency>NMP</v13:Currency>
                     <v13:Amount>1.000000</v13:Amount>
                  </v13:UnitPrice>
                  <v13:CustomsValue>
                     <v13:Currency>NMP</v13:Currency>
                     <v13:Amount>2500.000000</v13:Amount>
                  </v13:CustomsValue>
               </v13:Commodities>
            </v13:CustomsClearanceDetail>
            <v13:LabelSpecification>
               <v13:LabelFormatType>COMMON2D</v13:LabelFormatType>
               <v13:ImageType>PNG</v13:ImageType>
               <v13:LabelStockType>PAPER_7X4.75</v13:LabelStockType>
            </v13:LabelSpecification>
            <v13:RateRequestTypes>ACCOUNT</v13:RateRequestTypes>
            <v13:PackageCount>1</v13:PackageCount>
            <v13:RequestedPackageLineItems>
               <v13:SequenceNumber>1</v13:SequenceNumber>
               <v13:GroupPackageCount>1</v13:GroupPackageCount>
               <v13:InsuredValue>
                  <v13:Currency>NMP</v13:Currency>
                  <v13:Amount>100.00</v13:Amount>
               </v13:InsuredValue>
               <v13:Weight>
                  <v13:Units>LB</v13:Units>
                  <v13:Value>50.0</v13:Value>
               </v13:Weight>
               <v13:Dimensions>
                  <v13:Length>5</v13:Length>
                  <v13:Width>5</v13:Width>
                  <v13:Height>5</v13:Height>
                  <v13:Units>IN</v13:Units>
               </v13:Dimensions>
               <v13:ItemDescription>fjldfjsdl</v13:ItemDescription>
               <v13:CustomerReferences>
                  <v13:CustomerReferenceType>INTRACOUNTRY_REGULATORY_REFERENCE</v13:CustomerReferenceType>
                  <v13:Value>INTRA_MX_FEDEX_EXPRESS_SAVER</v13:Value>
               </v13:CustomerReferences>
            </v13:RequestedPackageLineItems>
         </v13:RequestedShipment>
      </v13:RateRequest>
   </soapenv:Body>
</soapenv:Envelope>